### Note
* Instructions have been included for each segment. You do not have to follow them exactly, but they are included to help you think through the steps.

In [30]:
# Dependencies and Setup
import pandas as pd
import numpy as np

# File to Load (Remember to Change These)
file_to_load = "Resources/purchase_data.csv"

# Read Purchasing File and store into Pandas data frame
purchase_data = pd.read_csv(file_to_load)
purchase_data.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

## Player Count

* Display the total number of players

In [31]:
#Total number of Players
total_num_player=len(list(purchase_data["SN"].unique()))
print(total_num_player)

576

## Purchasing Analysis (Total)

   Number of Unique Items Average Price Number of Purchases Total Revenue
0                     179         $3.05                 780     $2,379.77

* Run basic calculations to obtain number of unique items, average price, etc.


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [32]:
#number of unique items
num_items=len(list(purchase_data["Item Name"].unique()))
num_items

179

In [33]:
#number of purchases
tot_num_purchases=len(list(purchase_data["Purchase ID"].unique()))
tot_num_purchases

780

In [34]:
#total revenue
total_rev = purchase_data["Price"].sum()
total_rev_curr="${:,.2f}".format(total_rev)
print(total_rev_curr)

$2,379.77

In [35]:
#average price
ave_price=(total_rev/tot_num_purchases)
ave_price_curr="${:,.2f}".format(ave_price)
print(ave_price_curr)

$3.05

In [36]:
pd.DataFrame({
    "Number of Unique Items" : [num_items,0],
    "Average Price": [ave_price_curr,0],
    "Number of Purchases" : [tot_num_purchases,0],
    "Total Revenue" : [total_rev_curr,0],
})

   Number of Unique Items Average Price  Number of Purchases Total Revenue
0                     179         $3.05                  780     $2,379.77
1                       0             0                    0             0

## Gender Demographics

                       Total Count Percentage of Players
Male                           484                84.03%
Female                          81                14.06%
Other / Non-Disclosed           11                 1.91%

* Percentage and Count of Male Players


* Percentage and Count of Female Players


* Percentage and Count of Other / Non-Disclosed

In [37]:
#total number of male players, plus percentage of male players
male_players = purchase_data.loc[purchase_data["Gender"] == "Male"]
m_count=len(male_players["SN"].unique())
print(m_count)
m_player_percent="{:,.2f}%".format((m_count/total_num_player)*100)
print(m_player_percent)

484
84.03%

In [38]:
#total number of female players, plus percentage of female players
female_players = purchase_data.loc[purchase_data["Gender"] == "Female"]
f_count=len(female_players["SN"].unique())
print(f_count)
f_player_percent="{:,.2f}%".format((f_count/total_num_player)*100)
print(f_player_percent)

81
14.06%

In [39]:
#total number of other players, plus percentage of other players
other_players = purchase_data.loc[purchase_data["Gender"] == "Other / Non-Disclosed"]
other_count=len(other_players["SN"].unique())
print(other_count)
other_player_percent="{:,.2f}%".format((other_count/total_num_player)*100)
print(other_player_percent)

11
1.91%

In [40]:
gender_dem_df=pd.DataFrame([
    {"Gender":"Male","Total Count":m_count, "Percentage of Players":m_player_percent},
    {"Gender":"Female","Total Count":f_count, "Percentage of Players":f_player_percent},
    {"Gender":"Other/Non-Disclosed","Total Count":other_count, "Percentage of Players":other_player_percent}
])
gender_dem_df

                Gender  Total Count Percentage of Players
0                 Male          484                84.03%
1               Female           81                14.06%
2  Other/Non-Disclosed           11                 1.91%


## Purchasing Analysis (Gender)

* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. by gender




* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
Gender,,,,
Female,113,$3.20,$361.94,$4.47
Male,652,$3.02,"$1,967.64",$4.07
Other / Non-Disclosed,15,$3.35,$50.19,$4.56

In [41]:
#male purchase count
male_purchase_count=purchase_data.loc[purchase_data["Gender"] == "Male",:]
male_purchase_count=len(male_purchase_count)
print(male_purchase_count)

652

In [42]:
#average purchase price males
avg_male_price=purchase_data.loc[purchase_data["Gender"]=="Male",["Price"]].mean()
round_avg_male_price=round(avg_male_price,2)
print(round_avg_male_price)

Price    3.02
dtype: float64

In [43]:
#female purchase count
female_purchase_count=purchase_data.loc[purchase_data["Gender"]=="Female",:]
female_purchase_count=len(female_purchase_count)
print(female_purchase_count)

113

In [44]:
#average purchase price females
avg_female_price=purchase_data.loc[purchase_data["Gender"]=="Female",["Price"]].mean()
round_avg_female_price=round(avg_female_price,2)
print(round_avg_female_price)

Price    3.2
dtype: float64

In [45]:
#other purchase count
other_purchase_count=purchase_data.loc[purchase_data["Gender"] == "Other / Non-Disclosed",:]
other_purchase_count=len(other_purchase_count)
print(other_purchase_count)

15

In [46]:
#average purchase price other
avg_other_price=purchase_data.loc[purchase_data["Gender"]=="Other / Non-Disclosed",["Price"]].mean()
round_avg_other_price=round(avg_other_price,2)
print(round_avg_other_price)

Price    3.35
dtype: float64

In [47]:
#total purchase value male
tot_male_price=purchase_data.loc[purchase_data["Gender"]=="Male",["Price"]].sum()
print(tot_male_price)

Price    1967.64
dtype: float64

In [48]:
#total purchase value female
tot_female_price=purchase_data.loc[purchase_data["Gender"]=="Female",["Price"]].sum()
print(tot_female_price)

Price    361.94
dtype: float64

In [49]:
#total purchase value other
tot_other_price=purchase_data.loc[purchase_data["Gender"]=="Other / Non-Disclosed",["Price"]].sum()
print(tot_other_price)

Price    50.19
dtype: float64

In [50]:
#total avg per person male
avg_tot_per_person_male=(tot_male_price/male_purchase_count)
print(avg_tot_per_person_male)

Price    3.017853
dtype: float64

In [51]:
#total avg per person female
avg_tot_per_person_female=(tot_female_price/female_purchase_count)
print(avg_tot_per_person_female)

Price    3.203009
dtype: float64

In [52]:
#total avg per person other
avg_tot_per_person_other=(tot_other_price/other_purchase_count)
print(avg_tot_per_person_other)

Price    3.346
dtype: float64

In [53]:
purchase_analy_gender_df=pd.DataFrame([
    {"Gender":"Female","Purchase Count":female_purchase_count,"Average Purchase Price":"${:.2f}".format(round_avg_female_price[0]),"Total Purchase Value":"${:.2f}".format(tot_female_price[0]),"Avg Total Purchase per Person":"${:.2f}".format(avg_tot_per_person_female[0])},
    {"Gender":"Male","Purchase Count":male_purchase_count,"Average Purchase Price":"${:.2f}".format(round_avg_male_price[0]),"Total Purchase Value":"${:.2f}".format(tot_male_price[0]),"Avg Total Purchase per Person":"${:.2f}".format(avg_tot_per_person_male[0])},
    {"Gender":"Other/Non-Disclosed","Purchase Count":other_purchase_count,"Average Purchase Price":"${:.2f}".format(round_avg_other_price[0]),"Total Purchase Value":"${:.2f}".format(tot_other_price[0]),"Avg Total Purchase per Person":"${:.2f}".format(avg_tot_per_person_other[0])}
])

purchase_analy_gender_df=purchase_analy_gender_df.set_index("Gender")
purchase_analy_gender_df.index.name= None
purchase_analy_gender_df

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
Female,113,$3.20,$361.94,$3.20
Male,652,$3.02,$1967.64,$3.02
Other/Non-Disclosed,15,$3.35,$50.19,$3.35

## Age Demographics

* Establish bins for ages


* Categorize the existing players using the age bins. Hint: use pd.cut()


* Calculate the numbers and percentages by age group


* Create a summary data frame to hold the results


* Optional: round the percentage column to two decimal points


* Display Age Demographics Table

       Total Count Percentage of Players
<10             17                 2.95%
10-14           22                 3.82%
15-19          107                18.58%
20-24          258                44.79%
25-29           77                13.37%
30-34           52                 9.03%
35-39           31                 5.38%
40+             12                 2.08%

In [54]:
#print(purchase_data["Age"].max())
#print(purchase_data["Age"].min())

age_bin=[0,9,14,19,24,29,34,39,46]
groups=["<10","10-14","15-19","20-24","25-29","30-34","35-39","40+"]

In [55]:
purchase_data["Age Ranges"]=pd.cut(purchase_data["Age"], bins=age_bin, labels=groups)
grouped_ages_df=purchase_data.groupby(["Age Ranges"])

In [56]:
age_count=grouped_ages_df["SN"].nunique()
#print(age_count)
age_percent=round((age_count/total_num_player*100),2)
#print(age_percent)

In [58]:
age_demographic_df=pd.DataFrame({
    "Total Count":age_count,
    "Percentage of Players":age_percent})

age_demographic_df

            Total Count  Percentage of Players
Age Ranges
<10                  17                   2.95
10-14                22                   3.82
15-19               107                  18.58
20-24               258                  44.79
25-29                77                  13.37
30-34                52                   9.03
35-39                31                   5.38
40+                  12                   2.08

## Purchasing Analysis (Age)

* Bin the purchase_data data frame by age


* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. in the table below


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
Age Ranges,,,,
<10,23,$3.35,$77.13,$4.54
10-14,28,$2.96,$82.78,$3.76
15-19,136,$3.04,$412.89,$3.86
20-24,365,$3.05,"$1,114.06",$4.32
25-29,101,$2.90,$293.00,$3.81
30-34,73,$2.93,$214.00,$4.12
35-39,41,$3.60,$147.67,$4.76
40+,13,$2.94,$38.24,$3.19

In [59]:
purchase_count=grouped_ages_df["Item ID"].count()
purchase_count

Age Ranges
<10       23
10-14     28
15-19    136
20-24    365
25-29    101
30-34     73
35-39     41
40+       13
Name: Item ID, dtype: int64

In [68]:
ave_pur_price=grouped_ages_df["Price"].mean()
ave_pur_price=round((ave_pur_price),2)
ave_pur_price

Age Ranges
<10      3.35
10-14    2.96
15-19    3.04
20-24    3.05
25-29    2.90
30-34    2.93
35-39    3.60
40+      2.94
Name: Price, dtype: float64

In [61]:
tot_pur_price=grouped_ages_df["Price"].sum()
tot_pur_price

Age Ranges
<10        77.13
10-14      82.78
15-19     412.89
20-24    1114.06
25-29     293.00
30-34     214.00
35-39     147.67
40+        38.24
Name: Price, dtype: float64

In [70]:
ave_tot_purc_per_person=tot_pur_price/age_count
ave_tot_purc_per_person=round((ave_tot_purc_per_person),2)
ave_tot_purc_per_person

Age Ranges
<10      4.54
10-14    3.76
15-19    3.86
20-24    4.32
25-29    3.81
30-34    4.12
35-39    4.76
40+      3.19
dtype: float64

In [71]:
age_purchase_ana_df=pd.DataFrame({
    "Purchase Count": purchase_count,"Average Purchase Price": ave_pur_price, "Total Purchase Value": tot_pur_price, "Avg. Total Purchase Per Person": ave_tot_purc_per_person
})
age_purchase_ana_df

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg. Total Purchase Per Person
Age Ranges,,,,
<10,23,3.35,77.13,4.54
10-14,28,2.96,82.78,3.76
15-19,136,3.04,412.89,3.86
20-24,365,3.05,1114.06,4.32
25-29,101,2.90,293.00,3.81
30-34,73,2.93,214.00,4.12
35-39,41,3.60,147.67,4.76
40+,13,2.94,38.24,3.19

## Top Spenders

* Run basic calculations to obtain the results in the table below


* Create a summary data frame to hold the results


* Sort the total purchase value column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

             Purchase Count Average Purchase Price Total Purchase Value
SN
Lisosia93                 5                  $3.79               $18.96
Idastidru52               4                  $3.86               $15.45
Chamjask73                3                  $4.61               $13.83
Iral74                    4                  $3.40               $13.62
Iskadarya95               3                  $4.37               $13.10

In [78]:
group_spenders_df=purchase_data.groupby(["SN"])

In [96]:
purcount=group_spenders_df["Item ID"].count()
purcount

SN
Adairialis76     1
Adastirin33      1
Aeda94           1
Aela59           1
Aelaria33        1
                ..
Yathecal82       3
Yathedeu43       2
Yoishirrala98    1
Zhisrisu83       2
Zontibe81        3
Name: Item ID, Length: 576, dtype: int64

In [101]:
ave_pur_price_spenders=group_spenders_df["Price"].mean()
ave_pur_price

Age Ranges
<10      3.35
10-14    2.96
15-19    3.04
20-24    3.05
25-29    2.90
30-34    2.93
35-39    3.60
40+      2.94
Name: Price, dtype: float64

In [102]:
tot_pur_val_spenders=group_spenders_df["Price"].sum()
tot_pur_val_spenders=tot_pur_val_spenders[""]

SN
Adairialis76     2.28
Adastirin33      4.48
Aeda94           4.91
Aela59           4.32
Aelaria33        1.79
                 ...
Yathecal82       6.22
Yathedeu43       6.02
Yoishirrala98    4.58
Zhisrisu83       7.89
Zontibe81        8.03
Name: Price, Length: 576, dtype: float64

In [116]:
spenders_df=pd.DataFrame({
"Purchase Count": purcount, "Average Purchase Prices":ave_pur_price, "Total Purchase Value":tot_pur_val_spenders
})

spenders_df=spenders_df.sort_values(["Total Purchase Value"], ascending=False)
spenders_df.head(5)

             Purchase Count  Average Purchase Prices  Total Purchase Value
Lisosia93               5.0                      NaN                 18.96
Idastidru52             4.0                      NaN                 15.45
Chamjask73              3.0                      NaN                 13.83
Iral74                  4.0                      NaN                 13.62
Iskadarya95             3.0                      NaN                 13.10

## Most Popular Items

* Retrieve the Item ID, Item Name, and Item Price columns


* Group by Item ID and Item Name. Perform calculations to obtain purchase count, average item price, and total purchase value


* Create a summary data frame to hold the results


* Sort the purchase count column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
92,Final Critic,13,$4.61,$59.99
178,"Oathbreaker, Last Hope of the Breaking Storm",12,$4.23,$50.76
145,Fiery Glass Crusader,9,$4.58,$41.22
132,Persuasion,9,$3.22,$28.99
108,"Extraction, Quickblade Of Trembling Hands",9,$3.53,$31.77

In [117]:
pop_items_df= purchase_data[["Item ID","Item Name", "Price"]]

In [119]:
grouped_items_df=pop_items_df.groupby(["Item ID", "Item Name"])

In [121]:
purchase_count_items=grouped_items_df["Item ID"].count()
#purchase_count_items

In [131]:
ave_item_price=grouped_items_df["Price"].mean()
ave_item_price=round((ave_item_price),2)

In [132]:
tot_pur_val_items=grouped_items_df["Price"].sum()

In [133]:
items_df=pd.DataFrame({
    "Purchase Count":purchase_count_items, "Item Price":ave_item_price,"Total Purchase Value":tot_pur_val_items
})
items_df=items_df.sort_values(["Total Purchase Value"], ascending=False)

items_df. head(5)

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
92,Final Critic,13,4.61,59.99
178,"Oathbreaker, Last Hope of the Breaking Storm",12,4.23,50.76
82,Nirvana,9,4.90,44.10
145,Fiery Glass Crusader,9,4.58,41.22
103,Singed Scalpel,8,4.35,34.80

## Most Profitable Items

* Sort the above table by total purchase value in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the data frame

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
92,Final Critic,13,$4.61,$59.99
178,"Oathbreaker, Last Hope of the Breaking Storm",12,$4.23,$50.76
82,Nirvana,9,$4.90,$44.10
145,Fiery Glass Crusader,9,$4.58,$41.22
103,Singed Scalpel,8,$4.35,$34.80

In [140]:
items_df

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
42,The Decapitator,1,1.75,1.75
104,Gladiator's Glaive,1,1.93,1.93
125,Whistling Mithril Warblade,2,1.00,2.00
126,Exiled Mithril Longsword,1,2.00,2.00
28,"Flux, Destroyer of Due Diligence",2,1.06,2.12
...,...,...,...,...
103,Singed Scalpel,8,4.35,34.80
145,Fiery Glass Crusader,9,4.58,41.22
82,Nirvana,9,4.90,44.10
178,"Oathbreaker, Last Hope of the Breaking Storm",12,4.23,50.76
92,Final Critic,13,4.61,59.99

In [146]:
items_df=items_df.sort_values(["Total Purchase Value"],ascending=False)
items_df.head(5)

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
92,Final Critic,13,4.61,59.99
178,"Oathbreaker, Last Hope of the Breaking Storm",12,4.23,50.76
82,Nirvana,9,4.90,44.10
145,Fiery Glass Crusader,9,4.58,41.22
103,Singed Scalpel,8,4.35,34.80